In [1]:
import pandas as pd 
import numpy as np

In [23]:
air = pd.read_csv('../../data/processed/aggregated_aqi_daily_max.csv')
bike = pd.read_csv('../../data/processed/aggregated_bikes.csv')
sta = pd.read_csv('../../data/processed/sta.csv')
weather = pd.read_csv('../../data/processed/weather.csv')

In [24]:
bike.shape

(1834, 4)

In [25]:
air.shape

(1095, 7)

In [26]:
sta.shape

(68, 2)

In [27]:
sta.groupby('date_clean').agg(n = ('date_clean', 'count')).sort_values('n')

            n
date_clean
2017-05-03  1
2018-08-24  1
2018-09-03  1
2018-09-25  1
2018-09-26  1
...        ..
2017-10-15  1
2017-10-14  1
2017-10-13  1
2017-10-19  1
2019-11-10  1

[68 rows x 1 columns]

In [28]:
air

            date  max_aqi  max_aqi_category   CO   NO2  OZONE  PM2.5
0     2018-09-01       52                 2  0.3   5.0   22.0   19.0
1     2018-09-02       61                 2  0.3   8.2   32.0   20.0
2     2018-09-03       70                 2  0.3   5.1   35.0   24.0
3     2018-09-04       67                 2  0.4  10.5   36.0   23.0
4     2018-09-05       66                 2  0.4  11.3   36.0   23.0
...          ...      ...               ...  ...   ...    ...    ...
1090  2018-04-26       53                 2  0.4  16.5   46.0   18.0
1091  2018-04-27       29                 1  0.5  12.9   43.0   10.0
1092  2018-04-28       23                 1  0.4  11.8   49.0    7.0
1093  2018-04-29       34                 1  0.3   6.0   49.0   17.0
1094  2018-04-30       33                 1  0.6  20.8   41.0   13.0

[1095 rows x 7 columns]

In [29]:
bike

      start_date   user_type  num_trips  avg_duration
0     2018-02-01    Customer        523   2005.279159
1     2018-02-01  Subscriber       4272    680.287219
2     2018-02-02    Customer        566   2112.296820
3     2018-02-02  Subscriber       4006    664.059411
4     2018-02-03    Customer        927   2366.887810
...          ...         ...        ...           ...
1829  2019-02-26  Subscriber       5030    577.995229
1830  2019-02-27    Customer        581   1165.531842
1831  2019-02-27  Subscriber       7134    643.361508
1832  2019-02-28    Customer        981   1348.260958
1833  2019-02-28  Subscriber       8848    648.019100

[1834 rows x 4 columns]

In [30]:
df = air.merge(bike, how='left', left_on='date', right_on='start_date')
air_bike_size = df.shape[0]

In [32]:
df = df.merge(sta, how='left', left_on='date', right_on='date_clean')
print(f'Size of new ({df.shape[0]}) same as old ({air_bike_size})? -> {df.shape[0] == air_bike_size}')

Size of new (2012) same as old (2012)? -> True

In [33]:
df.groupby('date').agg(n = ('date', 'count')).sort_values('n')

            n
date
2017-01-01  1
2017-04-25  1
2017-04-26  1
2017-04-27  1
2017-04-28  1
...        ..
2018-05-03  2
2018-05-04  2
2018-05-05  2
2018-05-07  2
2019-12-31  2

[1095 rows x 1 columns]

In [40]:
df['sta'] = df['sta'].fillna(0)

In [49]:
df.groupby('date').agg(n=('date', 'count')).reset_index().groupby('n').count()

   date
n
1   178
2   917

In [53]:
df_complete = df[~df['start_date'].isna()]
df_complete.shape

(1834, 13)

In [55]:
df_complete.sort_values('date')

,date,max_aqi,max_aqi_category,CO,NO2,OZONE,PM2.5,start_date,user_type,num_trips,avg_duration,date_clean,sta
302,2017-06-28,40,1,0.5,9.7,25.0,12.0,2017-06-28,Customer,102.0,3547.392157,NaN,0.0
303,2017-06-28,40,1,0.5,9.7,25.0,12.0,2017-06-28,Subscriber,530.0,666.452830,NaN,0.0
305,2017-06-29,67,2,0.4,10.1,25.0,25.0,2017-06-29,Subscriber,885.0,715.158192,NaN,0.0
304,2017-06-29,67,2,0.4,10.1,25.0,25.0,2017-06-29,Customer,134.0,3470.462687,NaN,0.0
307,2017-06-30,54,2,0.4,14.7,25.0,15.0,2017-06-30,Subscriber,824.0,596.106796,NaN,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
671,2019-12-29,45,1,0.5,19.5,35.0,12.0,2019-12-29,Subscriber,852.0,737.014085,NaN,0.0
672,2019-12-30,52,2,0.5,27.4,27.0,16.0,2019-12-30,Customer,2077.0,992.432354,NaN,0.0
673,2019-12-30,52,2,0.5,27.4,27.0,16.0,2019-12-30,Subscriber,2375.0,761.567158,NaN,0.0
675,2019-12-31,68,2,1.1,30.7,24.0,27.0,2019-12-31,Subscriber,2226.0,814.285714,NaN,0.0
674,2019-12-31,68,2,1.1,30.7,24.0,27.0,2019-12-31,Customer,2112.0,1230.360795,NaN,0.0

In [ ]:
df[~df['start_date'].isna()].sort_values('date')